; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph0 - mode
	thermograph2 - mode
	infrared3 - mode
	image1 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Star5 - direction
	GroundStation9 - direction
	Star11 - direction
	Star10 - direction
	GroundStation1 - direction
	GroundStation6 - direction
	Star7 - direction
	Star8 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph2)
	(supports instrument0 image1)
	(calibration_target instrument0 Star10)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation1)
	(calibration_target instrument1 Star10)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star7)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(have_image Star12 image1)
	(have_image Phenomenon13 image1)
	(have_image Planet14 image1)
	(have_image Planet15 infrared3)
	(have_image Planet16 thermograph0)
))

)

; plan
1. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 0 of 5
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument2 star7)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite0 planet15 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet15)
   goals met: 0 of 5
5. (take_image satellite0 planet15 instrument2 infrared3)
   added: (have_image planet15 infrared3)
   goals met: 1 of 5
6. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 1 of 5
7. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 5
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 5
9. (calibrate satellite0 instrument0 star10)
   added: (calibrated instrument0)
   goals met: 1 of 5
10. (turn_to satellite0 phenomenon13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 5
11. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 2 of 5
12. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 2 of 5
13. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 3 of 5
14. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 3 of 5
15. (take_image satellite0 planet16 instrument0 thermograph0)
   added: (have_image planet16 thermograph0)
   goals met: 4 of 5
16. (turn_to satellite0 star12 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star12)
   goals met: 4 of 5
17. (take_image satellite0 star12 instrument0 image1)
   added: (have_image star12 image1)
   goals met: 5 of 5
